app/Controllers/CursoController.php

SELECT *
FROM `p_curso` `p`
LEFT JOIN `p_status` `s` ON `s`.`id_status` = `p`.`id_status`
LEFT JOIN `p_curso_tipo` `t` ON `t`.`id_curso_tipo`  = `p`.`id_curso_tipo`
SELECT *
FROM `p_curso` `p`
LEFT JOIN `p_curso_status` `s` ON `s`.`id_curso_status` = `p`.`id_curso_status`
LEFT JOIN `p_curso_tipo` `t` ON `t`.`id_curso_tipo`  = `p`.`id_curso_tipo`
SELECT *
FROM `p_curso_tipo`
---
    public function index()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('p_curso p');
        $builder->join('p_status s', 's.id_status = p.id_status', 'left');
        $builder->join('p_curso_tipo t', 't.id_curso_tipo  = p.id_curso_tipo ', 'left');
        $data['dados']   = $builder->get()->getResultArray();
        $builder = $db->table('p_curso_tipo');
        $data['curso'] = $builder->get()->getResultArray();

SELECT *
FROM `p_curso_tipo`
---
    public function form($data = null)
    {
        helper (['form']);
        $db      = \Config\Database::connect();
        $builder = $db->table('p_curso_tipo');
        $data['curso'] = $builder->get()->getResultArray();

SELECT *
FROM `p_curso`
WHERE `id_curso` = '1'
---
    public function edit($id_curso = null)
    {
        $model = new CursoModel();
        if(isset($id_curso)){
            $db      = \Config\Database::connect();
            $builder = $db->table('p_curso');
            $builder->where('id_curso ', $id_curso);
            $data['curso_ed'] = $builder->get()->getRow();

SELECT *
FROM `p_curso`
WHERE `id_curso` = '26'
---
    public function update($id_curso = null){


        $db      = \Config\Database::connect();
        $builder = new CursoModel();
        $builder->where('id_curso', $id_curso);
        $data = $builder->get()->getResultArray();