app/Controllers/InstrucaoController.php

    public function index()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('p_instrucao p');
        $builder->join('p_status s', 's.id_status = p.id_status', 'left');
        $data['dados']   = $builder->get()->getResultArray();
---
SELECT *
FROM `p_instrucao` `p`
LEFT JOIN `p_status` `s` ON `s`.`id_status` = `p`.`id_status`

    public function form($data = null)
    {
        helper (['form']);
        $db      = \Config\Database::connect();
        $builder = new InstrucaoModel();

        $data['instrucao'] = $builder->get()->getResultArray();
---
SELECT *
FROM `p_instrucao`

    public function edit($id_instrucao = null)
    {
        $builder = new InstrucaoModel();

        if(isset($id_instrucao)){
            $db      = \Config\Database::connect();
            $builder = $db->table('p_instrucao');
            $builder->where('id_instrucao ', $id_instrucao);
            $data['instrucao_ed'] = $builder->get()->getRow();
---
SELECT *
FROM `p_instrucao`
WHERE `id_instrucao` = '12'