app/Controllers/UserController.php

	public function cad_user($id_user = null)
	{
		//echo '<pre>';

		//var_dump(get_defined_vars());

		if(isset($id_user)){

			$data['user_ed'] = $this->userModel->find($id_user);
---
SELECT *
FROM `s_user`
WHERE `s_user`.`id_user` = 'assets'

    public function cad_dados()
    {
    	$db      = \Config\Database::connect();
        $builder = $db->table('p_user_tipo');
        $data['user'] = $builder->get()->getResultArray();

        $builder = $db->table('p_curso');
        $data['curso'] = $builder->get()->getResultArray();

        $builder = $db->table('p_tratamento');
        $data['tratamento'] = $builder->get()->getResultArray();

        $builder = $db->table('p_posto');
        $data['posto'] = $builder->get()->getResultArray();

        $builder = $db->table('p_quadro');
        $data['quadro'] = $builder->get()->getResultArray();

        $builder = $db->table('p_especialidade');
        $data['especialidade'] = $builder->get()->getResultArray();

        $builder = $db->table('p_om');
        $data['om'] = $builder->get()->getResultArray();
---
SELECT *
FROM `p_user_tipo`
SELECT *
FROM `p_curso`
SELECT *
FROM `p_tratamento`
SELECT *
FROM `p_posto`
SELECT *
FROM `p_quadro`
SELECT *
FROM `p_especialidade`
SELECT *
FROM `p_om`